Reports/ДинамикаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ДинамикаРаботы</Name>
			<Comment>Пересобрано для релиза 3.7.13.18</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЗадолженностьПоОбъектамОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектамОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗадолженностьПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектам</Name>
			<Comment>Трейд Софт Задолженность по долговому обязательству</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Comment>Дополнительная аналитика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ДинамикаРаботы/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)  
	СформироватьНовуюВерсию();

	//Если Не Отчет.ТипМероприятия.Пустая() И ЗначениеЗаполнено(Отчет.ДатаС) И ЗначениеЗаполнено(Отчет.ДатаПо) И 
	//		ЗначениеЗаполнено(Отчет.ДатаНа) Тогда			
	//	//СформироватьНаСервере(); 
	//		Иначе
	//	Вопрос("Не заполнены обязательные реквизиты!", РежимДиалогаВопрос.ОК);
	//КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура СформироватьНовуюВерсию()
	ТабДок.Очистить();
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	//
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	
	//
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	ВЫБОР
	                      |		КОГДА ТИПЗНАЧЕНИЯ(Мероприятие.Объект) = ТИП(Справочник.ДолговыеОбязательства)
	                      |			ТОГДА Мероприятие.Объект.Должник
	                      |		ИНАЧЕ Мероприятие.Объект
	                      |	КОНЕЦ КАК Должник,
	                      |	Мероприятие.Объект КАК Объект
	                      |ПОМЕСТИТЬ НевыполненныеМероприятияПоОбъектам
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	НЕ Мероприятие.Выполнена
	                      |	И НЕ Мероприятие.ТипМероприятия.ПометкаУдаления
	                      |	И НЕ Мероприятие.ПометкаУдаления
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	НевыполненныеМероприятияПоОбъектам.ТипМероприятия КАК ТипМероприятия,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НевыполненныеМероприятияПоОбъектам.Должник) КАК КолВо,
	                      |	СУММА(ЗадолженностьПоОбъектамОстатки.СуммаДО) КАК Сумма
	                      |ИЗ
	                      |	НевыполненныеМероприятияПоОбъектам КАК НевыполненныеМероприятияПоОбъектам
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадолженностьПоОбъектамОстатки КАК ЗадолженностьПоОбъектамОстатки
	                      |		ПО НевыполненныеМероприятияПоОбъектам.Объект = ЗадолженностьПоОбъектамОстатки.Объект
	                      |ГДЕ
	                      |	ЗадолженностьПоОбъектамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыЗадолженности.Сумма)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	НевыполненныеМероприятияПоОбъектам.ТипМероприятия
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТипМероприятия УБЫВ");
	Результат1 = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(Мероприятие.Объект) = ТИП(Справочник.ДолговыеОбязательства)
	               |			ТОГДА Мероприятие.Объект.Должник
	               |		ИНАЧЕ Мероприятие.Объект
	               |	КОНЕЦ КАК Должник,
	               |	Мероприятие.Объект КАК Объект
	               |ПОМЕСТИТЬ ВыполненныеМероприятияПоОбъектам
	               |ИЗ
	               |	Задача.Мероприятие КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.Выполнена
	               |	И НЕ Мероприятие.ТипМероприятия.ПометкаУдаления
	               |	И НЕ Мероприятие.ПометкаУдаления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыполненныеМероприятияПоОбъектам.ТипМероприятия КАК ТипМероприятия,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыполненныеМероприятияПоОбъектам.Должник) КАК КолВо,
	               |	СУММА(ЗадолженностьПоОбъектамОстатки.СуммаДО) КАК Сумма
	               |ИЗ
	               |	ВыполненныеМероприятияПоОбъектам КАК ВыполненныеМероприятияПоОбъектам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадолженностьПоОбъектамОстатки КАК ЗадолженностьПоОбъектамОстатки
	               |		ПО ВыполненныеМероприятияПоОбъектам.Объект = ЗадолженностьПоОбъектамОстатки.Объект
	               |ГДЕ
	               |	ЗадолженностьПоОбъектамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыЗадолженности.Сумма)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыполненныеМероприятияПоОбъектам.ТипМероприятия";
	Результат2 = Запрос.Выполнить().Выбрать();
	
	Пока Результат1.Следующий() Цикл
		
		Область = Макет.ПолучитьОбласть("Строка");
		
		Область.Параметры.ТипМероприятия = Результат1.ТипМероприятия;
		Область.Параметры.КолВо1 = Результат1.КолВо;
		Область.Параметры.Сумма1 = Результат1.Сумма;  
		
		ПараметрыВывода = Новый Структура; 
		ПараметрыВывода.Вставить("ТипМероприятия", Результат1.ТипМероприятия); 
		
		Если Результат2.НайтиСледующий(ПараметрыВывода) Тогда				
			Область.Параметры.ТипМероприятия2 = Результат2.ТипМероприятия;
			Область.Параметры.КолВо2 = Результат2.КолВо;
			Область.Параметры.Сумма2 = Результат2.Сумма;
			
		КонецЕсли;   
		ТабДок.Вывести(Область);
	КонецЦикла;   
	
	Пока Результат2.Следующий() Цикл	
		Область = Макет.ПолучитьОбласть("Строка");		
		Область.Параметры.ТипМероприятия2 = Результат2.ТипМероприятия;
		Область.Параметры.КолВо2 = Результат2.КолВо;
		Область.Параметры.Сумма2 = Результат2.Сумма;
		
		ТабДок.Вывести(Область);
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура СформироватьНаСервере()
	ТабДок.Очистить();
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	//
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ТипМероприятия = Отчет.ТипМероприятия;
	Область.Параметры.Дата1 = Формат(Отчет.ДатаС, "ДФ=dd.MM.yyyy");
	Область.Параметры.Дата2 = Формат(Отчет.ДатаПо, "ДФ=dd.MM.yyyy");
	Область.Параметры.Дата3 = Формат(Отчет.ДатаНа, "ДФ=dd.MM.yyyy");	
	ТабДок.Вывести(Область);
	
	//
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Мероприятия.Объект КАК ОбъектКА
	                      |ПОМЕСТИТЬ ОбъектыКА
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятия
	                      |ГДЕ
	                      |	Мероприятия.ТипМероприятия = &Тип
	                      |	И Мероприятия.Выполнена
	                      |	И Мероприятия.ДатаВыполнения МЕЖДУ &ДатаС И &ДатаПо
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Мероприятия.Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Услуги1.Ссылка КАК ОбъектУ,
	                      |	ОбъектыКА.ОбъектКА
	                      |ПОМЕСТИТЬ ОбъектыУ
	                      |ИЗ
	                      |	ОбъектыКА КАК ОбъектыКА
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК Услуги1
	                      |		ПО ОбъектыКА.ОбъектКА = Услуги1.Должник
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	                      |				&ДатаПо,
	                      |				Организация = &Организация
	                      |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	                      |					И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ВРаботеУслуги
	                      |		ПО (Услуги1.Ссылка = ВРаботеУслуги.Объект)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(*) КАК КолВо1
	                      |ИЗ
	                      |	ОбъектыКА КАК ОбъектыКА
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(СУММА(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток), 0) КАК Сумма1
	                      |ИЗ
	                      |	ОбъектыУ КАК ОбъектыУ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаПо, ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ЗадолженностьПоОбъектамОстатки
	                      |		ПО ОбъектыУ.ОбъектУ = ЗадолженностьПоОбъектамОстатки.Объект
	                      |			И (ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток > 0)");
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Тип", Отчет.ТипМероприятия);
	Запрос.УстановитьПараметр("ДатаС", Отчет.ДатаС);
	Запрос.УстановитьПараметр("ДатаПо", Отчет.ДатаПо);
	Запрос.УстановитьПараметр("ДатаНа", Отчет.ДатаНа);
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Если Отчет.Организация.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Истина");
	КонецЕсли;
	Результат1 = Запрос.ВыполнитьПакет();
	
	//
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыМероприятий.Ссылка,
	               |	ТипыМероприятий.Наименование
	               |ПОМЕСТИТЬ ТипыМ
	               |ИЗ
	               |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	               |ГДЕ
	               |	ТипыМероприятий.Родитель.Код = ""0012     ""
	               |	И НЕ ТипыМероприятий.Наименование ПОДОБНО ""6* %""
	               |	И ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	               |	И ТипыМероприятий.ЭтоГруппа = ЛОЖЬ
	               |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъектыУ.ОбъектКА,
	               |	ЕСТЬNULL(СУММА(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток), 0) КАК Сумма
	               |ПОМЕСТИТЬ СуммаПоКА
	               |ИЗ
	               |	ОбъектыУ КАК ОбъектыУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |				&ДатаНа,
	               |				Организация = &Организация
	               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |					И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ВРаботеУслуги
	               |		ПО ОбъектыУ.ОбъектУ = ВРаботеУслуги.Объект
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаНа, ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ЗадолженностьПоОбъектамОстатки
	               |		ПО ОбъектыУ.ОбъектУ = ЗадолженностьПоОбъектамОстатки.Объект
	               |			И (ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток > 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбъектыУ.ОбъектКА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъектыКА.ОбъектКА КАК ОбъектКА,
	               |	МАКСИМУМ(Мероприятия.ТипМероприятия) КАК ТипМ
	               |ПОМЕСТИТЬ ТипыМПоКА
	               |ИЗ
	               |	ОбъектыКА КАК ОбъектыКА
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |				&ДатаНа,
	               |				Организация = &Организация
	               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |					И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.Контрагенты)) КАК ВРаботеУслуги
	               |		ПО ОбъектыКА.ОбъектКА = ВРаботеУслуги.Объект
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятия
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыМ КАК ТипыМ
	               |			ПО (ТипыМ.Ссылка = Мероприятия.ТипМероприятия)
	               |				И (Мероприятия.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)
	               |					ИЛИ Мероприятия.ДатаВыполнения >= &ДатаНа)
	               |				И (Мероприятия.Дата < &ДатаНа)
	               |				И (Мероприятия.ПометкаУдаления = ЛОЖЬ)
	               |				И (Мероприятия.БизнесПроцесс.ПометкаУдаления = ЛОЖЬ)
	               |		ПО ОбъектыКА.ОбъектКА = Мероприятия.Объект
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбъектыКА.ОбъектКА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ТипыМПоКА.ТипМ ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КолВо2,
	               |	ЕСТЬNULL(СУММА(ЕСТЬNULL(СуммаПоКА.Сумма, 0)), 0) КАК Сумма2,
	               |	ТипыМ.Ссылка КАК ТипМероприятия2
	               |ИЗ
	               |	ТипыМ КАК ТипыМ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТипыМПоКА КАК ТипыМПоКА
	               |			ЛЕВОЕ СОЕДИНЕНИЕ СуммаПоКА КАК СуммаПоКА
	               |			ПО ТипыМПоКА.ОбъектКА = СуммаПоКА.ОбъектКА
	               |		ПО ТипыМ.Ссылка = ТипыМПоКА.ТипМ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТипыМ.Ссылка,
	               |	ТипыМ.Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипыМ.Наименование";
	Если Отчет.Организация.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Истина");
	КонецЕсли;
	Результат2 = Запрос.Выполнить().Выбрать();
	
	//
	ФлагПерваяСтрока = Истина;
	Пока Результат2.Следующий() Цикл
		Область = Макет.ПолучитьОбласть("Строка");
		
		Если ФлагПерваяСтрока Тогда			
			Область.Параметры.ТипМероприятия = Отчет.ТипМероприятия;
			Область.Параметры.КолВо1 = Результат1[Результат1.ВГраница() - 1].Выгрузить()[0].КолВо1;
			Область.Параметры.Сумма1 = Результат1[Результат1.ВГраница()].Выгрузить()[0].Сумма1;
			ФлагПерваяСтрока = Ложь;
		КонецЕсли;
			
		Область.Параметры.ТипМероприятия2 = Результат2.ТипМероприятия2;
		Область.Параметры.КолВо2 = Результат2.КолВо2;
		Область.Параметры.Сумма2 = Результат2.Сумма2;
		
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	//Пустая строка
	Область = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(Область);
	
	//Подвал
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.ТипМероприятия2 = "Переданы в юр.отдел";
	Область.Параметры.КолВо2 = 0;
	ТабДок.Вывести(Область);
	
	//
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыУ.ОбъектКА) КАК КолВо2
	               |ИЗ
	               |	ОбъектыУ КАК ОбъектыУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |				&ДатаНа,
	               |				Организация = &Организация
	               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |					И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ВРаботеУслуги
	               |		ПО ОбъектыУ.ОбъектУ = ВРаботеУслуги.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаНа, ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ЗадолженностьПоОбъектамОстатки
	               |		ПО ОбъектыУ.ОбъектУ = ЗадолженностьПоОбъектамОстатки.Объект
	               |			И (ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток > 0)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК Услуги
	               |		ПО ОбъектыУ.ОбъектУ = Услуги.Ссылка
	               |			И (Услуги.Значение = ЛОЖЬ)
	               |			И (Услуги.Свойство = &Свойство)
	               |ГДЕ
	               |	(ВРаботеУслуги.Объект ЕСТЬ NULL 
	               |			ИЛИ ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток, 0) <= 0)";
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("!!!!"));
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.ТипМероприятия2 = "Процесс завершен оплатой";
	Область.Параметры.КолВо2 = Запрос.Выполнить().Выгрузить()[0].КолВо2;
	ТабДок.Вывести(Область);
	
	//
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыУ.ОбъектКА) КАК КолВо2
	               |ИЗ
	               |	ОбъектыУ КАК ОбъектыУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |				&ДатаНа,
	               |				Организация = &Организация
	               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |					И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ВРаботеУслуги
	               |		ПО ОбъектыУ.ОбъектУ = ВРаботеУслуги.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаНа, ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ЗадолженностьПоОбъектамОстатки
	               |		ПО ОбъектыУ.ОбъектУ = ЗадолженностьПоОбъектамОстатки.Объект
	               |			И (ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток > 0)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК Услуги
	               |		ПО ОбъектыУ.ОбъектУ = Услуги.Ссылка
	               |			И (Услуги.Значение = ИСТИНА)
	               |			И (Услуги.Свойство = &Свойство)
	               |ГДЕ
	               |	(ВРаботеУслуги.Объект ЕСТЬ NULL 
	               |			ИЛИ ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток, 0) <= 0)";
	
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.ТипМероприятия2 = "Процесс завершен корректировкой";
	Область.Параметры.КолВо2 = Запрос.Выполнить().Выгрузить()[0].КолВо2;
	ТабДок.Вывести(Область);
КонецПроцедуры
